import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-room',
  templateUrl: './room.component.html',
  styleUrls: ['./room.component.css']
})
export class RoomComponent implements OnInit {
  roomPage = {
    title : 'ห้องพักสไตล์บาหลี',
    saveRoom : 
    {
      title: 'ห้องพักราคาประหยัด',
      imgSrc: 'assets/dist/img/r1.jpg',
      desc: 'ห้องพักกว้างตกแต่งห้องพักสไตล์บาหลี ราคาหลักร้อยให้ทัศนียภาพอันงดงามของธรรมชาติร่มรื่นไปด้วยต้นไม้น้อยใหญ่ไม้ดอกไม้ประดับ มีที่จอดรถส่วนตัว สิ่งอำนวยความสะดวกภายในห้องพักอย่างครบครัน อาทิ เครื่องปรับอากาศ เครื่องทำน้ำอุ่น ทุกห้องจะมีระเบียงสามารถนั่งเล่นเพื่อผ่อนคลายและชมช่องรายการโทรทัศน์ผ่านดาวเทียม '
    },
    vipRoom : 
    {
      title: 'ห้องพัก VIP',
      imgSrc: 'assets/dist/img/r2.jpg',
      desc: 'ดื่มด่ำกับทัศนียภาพที่เงียบสงบห้องพักสะดวกสบายให้ความเป็นส่วนตัวเป็นส่วนตัวเหมาะสำหรับลูกค้าที่ต้องการความเป็นส่วนตัวและการพักผ่อนแบบครอบครัวภายในตกแต่งห้องพักสไตล์บาหลีพร้อมสิ่งอำนวยความสะดวกครบครันเพื่อการพักผ่อนที่แสนสบายรออกแบบอย่างมีรสนิยมแล้วห้องพักที่น่าสนใจเหล่านี้ยังสามารถทำงานได้ดี'
    }

  };
  constructor() { }

  ngOnInit() {
  }

}
